#+TITLE: README
#+AUTHOR: Ben Mezger
#+EMAIL: me@benmezger.nl
#+DATE: <2021-02-09 Tue 00:19>

#+HTML_DOCTYPE: xhtml5
#+HTML_HTML5_FANCY:

These scripts are ran by =chezmoi= on =apply=, but it may be used independently by
either running them with the provided [[https://github.com/benmezger/dotfiles/blob/main/Makefile][Makefile]] or by executing them with =bash=.

#+BEGIN_SRC sh :results table
exa --ignore-glob "buildcheck.sh|README.org|ansi|base.sh"
#+END_SRC

#+RESULTS:
| configure_sys.sh          |
| ensure_directories.sh     |
| fix_gnupg_perms.sh        |
| install_aur_packages.sh   |
| install_chezmoi.sh        |
| install_deps.sh           |
| install_git_repos.sh      |
| install_homebrew.sh       |
| install_pyenv.sh          |
| install_riscv.sh          |
| set_archlinux_defaults.sh |
| set_firewall_rules.sh     |
| set_osx_defaults.sh       |
| set_ssh_perms.sh          |
| start_services.sh         |
